---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StairsTriserIsTypeOverridden
source: html/44539790-1e4f-a0d4-0062-f62d498736c7.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StairsTriserIsTypeOverridden Property

"Overridden": (OBSOLETE) Indicate whether selected individual step is governed by default type setting.

## Syntax (C#)
```csharp
public static ForgeTypeId StairsTriserIsTypeOverridden { get; }
```